results/test17_mixed_workload_v2/fio-t17-32k-11.log
Starting FIO benchmark on pod 11...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=10G
runtime=900
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=32

[test17-mixed-32k]
rw=randrw
rwmixread=50
bs=32k
# 2,000 IOPS per pod / 8 threads = 250 IOPS per thread
rate_iops=250
---
test17-mixed-32k: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
...
fio-3.41
Starting 8 processes
test17-mixed-32k: Laying out IO file (1 file / 10240MiB)
test17-mixed-32k: Laying out IO file (1 file / 10240MiB)
test17-mixed-32k: Laying out IO file (1 file / 10240MiB)
[...]

test17-mixed-32k: (groupid=0, jobs=8): err= 0: pid=79: Sun Sep  6 15:49:27 2026
  read: IOPS=1999, BW=62.5MiB/s (65.5MB/s)(54.9GiB/900002msec)
    slat (usec): min=2, max=436, avg= 8.95, stdev= 6.45
    clat (usec): min=149, max=460450, avg=1000.57, stdev=1431.93
     lat (usec): min=213, max=460459, avg=1009.53, stdev=1431.92
    clat percentiles (usec):
     |  1.00th=[  293],  5.00th=[  367], 10.00th=[  490], 20.00th=[  562],
     | 30.00th=[  611], 40.00th=[  660], 50.00th=[  717], 60.00th=[  791],
     | 70.00th=[  906], 80.00th=[ 1156], 90.00th=[ 1696], 95.00th=[ 2409],
     | 99.00th=[ 5014], 99.50th=[ 6587], 99.90th=[14746], 99.95th=[18482],
     | 99.99th=[38011]
   bw (  KiB/s): min=40896, max=87187, per=100.00%, avg=64008.80, stdev=147.04, samples=14393
   iops        : min= 1278, max= 2724, avg=2000.08, stdev= 4.59, samples=14393
  write: IOPS=1999, BW=62.5MiB/s (65.5MB/s)(54.9GiB/900002msec); 0 zone resets
    slat (usec): min=3, max=1161, avg=11.54, stdev= 7.11
    clat (usec): min=115, max=459758, avg=777.72, stdev=1383.27
     lat (usec): min=283, max=459774, avg=789.27, stdev=1383.29
    clat percentiles (usec):
     |  1.00th=[  351],  5.00th=[  379], 10.00th=[  396], 20.00th=[  424],
     | 30.00th=[  449], 40.00th=[  474], 50.00th=[  506], 60.00th=[  545],
     | 70.00th=[  611], 80.00th=[  742], 90.00th=[ 1352], 95.00th=[ 2147],
     | 99.00th=[ 4686], 99.50th=[ 6194], 99.90th=[14091], 99.95th=[17957],
     | 99.99th=[34341]
   bw (  KiB/s): min=41344, max=86720, per=100.00%, avg=64008.82, stdev=145.85, samples=14393
   iops        : min= 1292, max= 2710, avg=2000.08, stdev= 4.56, samples=14393
  lat (usec)   : 250=0.02%, 500=29.79%, 750=37.77%, 1000=13.06%
  lat (msec)   : 2=12.91%, 4=4.89%, 10=1.37%, 20=0.16%, 50=0.03%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.35%, sys=0.65%, ctx=5296681, majf=0, minf=4212
  IO depths    : 1=48.2%, 2=49.5%, 4=1.8%, 8=0.3%, 16=0.1%, 32=0.1%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1799998,1799998,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=62.5MiB/s (65.5MB/s), 62.5MiB/s-62.5MiB/s (65.5MB/s-65.5MB/s), io=54.9GiB (59.0GB), run=900002-900002msec
  WRITE: bw=62.5MiB/s (65.5MB/s), 62.5MiB/s-62.5MiB/s (65.5MB/s-65.5MB/s), io=54.9GiB (59.0GB), run=900002-900002msec
FIO benchmark completed on pod 11