results/test17_mixed_workload_v2/fio-t17-64k-3.log
Starting FIO benchmark on pod 3...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=10G
runtime=900
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

[test17-mixed-64k]
rw=randrw
rwmixread=50
bs=64k
# 2,000 IOPS per pod / 8 threads = 250 IOPS per thread
rate_iops=250
---
test17-mixed-64k: (g=0): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
test17-mixed-64k: Laying out IO file (1 file / 10240MiB)
test17-mixed-64k: Laying out IO file (1 file / 10240MiB)
test17-mixed-64k: Laying out IO file (1 file / 10240MiB)
[...]

test17-mixed-64k: (groupid=0, jobs=8): err= 0: pid=79: Sun Sep  6 15:49:27 2026
  read: IOPS=1999, BW=125MiB/s (131MB/s)(110GiB/900003msec)
    slat (usec): min=3, max=848, avg=11.06, stdev= 7.38
    clat (usec): min=168, max=473403, avg=1242.38, stdev=3502.86
     lat (usec): min=246, max=473411, avg=1253.44, stdev=3502.86
    clat percentiles (usec):
     |  1.00th=[   355],  5.00th=[   424], 10.00th=[   502], 20.00th=[   660],
     | 30.00th=[   750], 40.00th=[   816], 50.00th=[   881], 60.00th=[   955],
     | 70.00th=[  1074], 80.00th=[  1319], 90.00th=[  1893], 95.00th=[  2638],
     | 99.00th=[  5669], 99.50th=[  8160], 99.90th=[ 44303], 99.95th=[ 71828],
     | 99.99th=[154141]
   bw (  KiB/s): min=73600, max=180352, per=100.00%, avg=128018.53, stdev=379.17, samples=14392
   iops        : min= 1150, max= 2818, avg=2000.13, stdev= 5.92, samples=14392
  write: IOPS=1999, BW=125MiB/s (131MB/s)(110GiB/900003msec); 0 zone resets
    slat (usec): min=5, max=428, avg=15.54, stdev= 8.38
    clat (usec): min=209, max=459679, avg=944.98, stdev=1596.64
     lat (usec): min=371, max=459693, avg=960.52, stdev=1596.66
    clat percentiles (usec):
     |  1.00th=[  449],  5.00th=[  486], 10.00th=[  510], 20.00th=[  545],
     | 30.00th=[  586], 40.00th=[  619], 50.00th=[  660], 60.00th=[  717],
     | 70.00th=[  791], 80.00th=[  947], 90.00th=[ 1549], 95.00th=[ 2343],
     | 99.00th=[ 4948], 99.50th=[ 6521], 99.90th=[16057], 99.95th=[20579],
     | 99.99th=[39584]
   bw (  KiB/s): min=73984, max=179712, per=100.00%, avg=128018.46, stdev=369.11, samples=14392
   iops        : min= 1156, max= 2808, avg=2000.13, stdev= 5.77, samples=14392
  lat (usec)   : 250=0.01%, 500=8.85%, 750=39.01%, 1000=25.30%
  lat (msec)   : 2=19.04%, 4=5.94%, 10=1.56%, 20=0.18%, 50=0.08%
  lat (msec)   : 100=0.03%, 250=0.01%, 500=0.01%
  cpu          : usr=0.43%, sys=0.75%, ctx=5282103, majf=0, minf=3923
  IO depths    : 1=47.8%, 2=49.2%, 4=2.1%, 8=0.4%, 16=0.5%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1799999,1799999,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=125MiB/s (131MB/s), 125MiB/s-125MiB/s (131MB/s-131MB/s), io=110GiB (118GB), run=900003-900003msec
  WRITE: bw=125MiB/s (131MB/s), 125MiB/s-125MiB/s (131MB/s-131MB/s), io=110GiB (118GB), run=900003-900003msec
FIO benchmark completed on pod 3